//
//  uranPageView.swift
//  Maknoon
//
//  Created by Mahmoud Diab on 03/06/2025.
//

import SwiftUI

struct QuranPageView: View {
    let lines: [String]
    let linesPerPage: Int

    var body: some View {
        GeometryReader { geometry in
            VStack(spacing: 0) {
                ForEach(0..<min(lines.count, linesPerPage), id: \.self) { index in
                    Text(lines[index])
                        .font(.custom("TE HAFS2 Tharwat Emara", size: 18)) // Use your desired font
                        .frame(width: geometry.size.width, height: geometry.size.height / CGFloat(linesPerPage), alignment: .trailing)
                        .multilineTextAlignment(.trailing)
                }
            }
            .environment(\.layoutDirection, .rightToLeft)
        }
    }
}



struct AlBaqarahData {
    static let alBaqarahBeginning =  [
        "\nإِنَّ ٱلَّذِينَ كَفَرُواْ سَوَآءٌ عَلَيۡهِمۡ ءَأَنذَرۡتَهُمۡ أَمۡ لَمۡ تُنذِرۡهُمۡ",
        "لَا يُؤۡمِنُونَ ٦ خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَعَلَىٰ\n",
        "سَمۡعِهِمۡۖ وَعَلَىٰٓ أَبۡصَٰرِهِمۡ غِشَٰوَةٞۖ وَلَهُمۡ عَذَابٌ عَظِيمٞ ٧ وَمِنَ ٱلنَّاسِ\n",
        "مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَمَا هُم بِمُؤۡمِنِينَ ٨\n",
        "يُخَٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُواْ وَمَا يَخۡدَعُونَ إِلَّآ أَنفُسَهُمۡ وَمَا\n",
        "يَشۡعُرُونَ ٩ فِي قُلُوبِهِم مَّرَضٞ فَزَادَهُمُ ٱللَّهُ مَرَضٗاۖ وَلَهُمۡ\n",
        "عَذَابٌ أَلِيمُۢ بِمَا كَانُواْ يَكۡذِبُونَ ٠١ وَإِذَا قِيلَ لَهُمۡ\n",
        "لَا تُفۡسِدُواْ فِي ٱلۡأَرۡضِ قَالُوٓاْ إِنَّمَا نَحۡنُ مُصۡلِحُونَ ١١ أَلَآ إِنَّهُمۡ\n",
        "هُمُ ٱلۡمُفۡسِدُونَ وَلَٰكِن لَّا يَشۡعُرُونَ ٢١ وَإِذَا قِيلَ لَهُمۡ\n",
        "ءَامِنُواْ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓاْ أَنُؤۡمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُۗ\n",
        "أَلَآ إِنَّهُمۡ هُمُ ٱلسُّفَهَآءُ وَلَٰكِن لَّا يَعۡلَمُونَ ٣١ وَإِذَا لَقُواْ\n",
        "ٱلَّذِينَ ءَامَنُواْ قَالُوٓاْ ءَامَنَّا وَإِذَا خَلَوۡاْ إِلَىٰ شَيَٰطِينِهِمۡ قَالُوٓاْ إِنَّا\n",
        "مَعَكُمۡ إِنَّمَا نَحۡنُ مُسۡتَهۡزِءُونَ٤١ٱللَّهُ يَسۡتَهۡزِئُ بِهِمۡ وَيَمُدُّهُم\n",
        "فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ ٥١ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلضَّلَٰلَةَ\n",
        "بِٱلۡهُدَىٰ فَمَا رَبِحَت تِّجَٰرَتُهُمۡ وَمَا كَانُواْ مُهۡتَدِينَ ٦١\n"
      ]
    
}

